{
    "Light Hull Armor": {
        "name": "Light Hull Armor",
        "price": {
            "small": 100,
            "medium": 500,
            "large": 1500,
            "huge": 6000
        },
        "rarity": "Common",
        "weight": {
            "small": -0.5,
            "medium": -10,
            "large": -25,
            "huge": -100
        },
        "description": "This lighter version of the hull armor skims off some of the weight. Giving room to more cargo capacity and speed at the cost of armor. This lowers your ships AC by 2 and its Hull Points and Hull Dice by 20% (rounded down). It also lowers the Damage Treshold by 5 for Small and Medium and 10 for Large and Heavy. In return it creates cargo space and weight according to its weight in the upgrades table and increases the speed of all stations, engines and maximum speed by 20% (each rounded up to nearest 5ft.)."
    },
    "Medium Hull Armor": {
        "name": "Medium Hull Armor",
        "price": {
            "small": 0,
            "medium": 0,
            "large": 0,
            "huge": 0
        },
        "rarity": "Common",
        "weight": {
            "small": 0,
            "medium": 0,
            "large": 0,
            "huge": 0
        },
        "description": "This is the standard hull armor. This is what a ship normally comes equipped with. Note: this webpage assumes a price of 0 for Medium Armor."
    },
    "Heavy Hull Armor": {
        "name": "Heavy Hull Armor",
        "price": {
            "small": 300,
            "medium": 1500,
            "large": 4500,
            "huge": 18000
        },
        "rarity": "Common",
        "weight": {
            "small": 0.5,
            "medium": 10,
            "large": 25,
            "huge": 100
        },
        "description": "This heavier version of the hull armor bulks up your defences at the cost of some weight and speed. This increases your ship AC by 2 and its Hull Points and Hull Dice by 20% (rounded down). It also increases the Damage Treshold by 5 for Small and Medium and 10 for Large and Heavy. In return it costs cargo space and weight according to its weight in the upgrades table and decreases the speed of all stations, engines and maximum speed by 20% (each rounded down to nearest 5ft.)."
    },
    "Kite Shield": {
        "name": "Kite Shield",
        "price": {
            "small": 40,
            "medium": 100,
            "large": 200,
            "huge": 400
        },
        "rarity": "Uncommon",
        "weight": {
            "small": 1,
            "medium": 4,
            "large": 8,
            "huge": 16
        },
        "ac": 18,
        "hp": {
            "small": 40,
            "medium": 100,
            "large": 200,
            "huge": 400
        },
        "immunities": [
            "fire",
            "poison",
            "psychic"
        ],
        "description": "This shield is mounted on the Bow of the ship and blocks all forward-facing weapon slots. It also increases the Bow-side AC by 5."
    },
    "Spell Shield": {
        "name": "Spell Shield",
        "price": {
            "small": 500,
            "medium": 1250,
            "large": 3000,
            "huge": 7500
        },
        "rarity": "Very Rare",
        "weight": {
            "small": 0,
            "medium": 0.5,
            "large": 2,
            "huge": 5
        },
        "ac": 20,
        "hp": {
            "small": 20,
            "medium": 40,
            "large": 80,
            "huge": 160
        },
        "immunities": [
            "fire",
            "poison",
            "psychic"
        ],
        "description": "This shield exists mostly of runes across the ship that comes together in a small central altar. This allows for a spellcaster to put in mana to increase the strength of the ship. A spellcaster can move up to the altar and spend a spellslot. Increasing the ships AC by the amount of spell-levels for the duration of the spellcasting modifierinrounds. For instance: a druid with a +4 spellcasting (Wisdom) modifier puts in a 2ndlevel spellslot. This provides a +2 for 4 rounds. The SpellShield can provide a constant +2 to AC when provided power from a Magic Core. A ship can only have one of two magical shields."
    },
    "Arcane Shield": {
        "name": "Arcane Shield",
        "price": {
            "small": 1000,
            "medium": 2500,
            "large": 6000,
            "huge": 15000
        },
        "rarity": "Very Rare",
        "weight": {
            "small": 0,
            "medium": 0.5,
            "large": 2,
            "huge": 5
        },
        "ac": 20,
        "hp": {
            "small": 20,
            "medium": 40,
            "large": 80,
            "huge": 160
        },
        "immunities": [
            "fire",
            "poison",
            "psychic"
        ],
        "description": "A special lattice of inks, metals, and crushed gemstones, woven into the hull of a ship by skilled artificers, all converging into a large control rune usually branded into the middle of the top deck of the ship. Once activated from the control rune, this magically reactive shield provides a ship with a degree of protection against harmful spells.As an action, a character may stand at and activate the ship’s spell shield rune. Until the start of that character’s next turn, the ship does not instantly fail Strength or Dexterity saving throws imposed by magical effects. Instead, the character that used the control rune may roll the saving throw for the ship, by rolling a d20 and adding their Strength or Dexterity modifier and adding their proficiency bonus (if proficient in Arcana). The character must be capable of succeeding on Strength and Dexterity saving throws at the time of the roll in order to use this ability.The Spell Shield can provide a constant 10+ (Intelligence) Arcanamodifier(of the character that activated it) on the saving throws when provide power from a Magic Core. A ship can only have one of two magical shields."
    },
    "Sails (Canvas)": {
        "name": "Sails (Canvas)",
        "price": {
            "small": 0,
            "medium": 0,
            "large": 0,
            "huge": 0
        },
        "rarity": "Common",
        "weight": {
            "small": 0.01,
            "medium": 0.15,
            "large": 1,
            "huge": 3.5
        },
        "ac": 16,
        "hp": {
            "small": 5,
            "medium": 10,
            "large": 20,
            "huge": 40
        },
        "immunities": [
            "poison",
            "psychic"
        ],
        "vulnerabilities": [
            "fire"
        ],
        "description": "Your standard sail is a canvas sail. This provides a good light sturdy and most importantly cheap cloth that can resist the elements. Note: Canvas sails are default equipment and don't count towards ship price."
    },
    "Sails (Linen)": {
        "name": "Sails (Linen)",
        "price": {
            "small": 120,
            "medium": 1800,
            "large": 12000,
            "huge": 42000
        },
        "rarity": "Rare",
        "weight": {
            "small": 0.01,
            "medium": 0.15,
            "large": 1,
            "huge": 3.5
        },
        "ac": 18,
        "hp": {
            "small": 15,
            "medium": 30,
            "large": 60,
            "huge": 120
        },
        "immunities": [
            "poison",
            "psychic"
        ],
        "description": "These luxurious sails are made of linen and provides a good light sturdy cloth that can resist the elements and hold a punch."
    },
    "Solar Sails": {
        "name": "Solar Sails",
        "price": {
            "small": 1000,
            "medium": 15000,
            "large": 80000,
            "huge": 360000
        },
        "rarity": "Very Rare",
        "weight": {
            "small": 0.01,
            "medium": 0.15,
            "large": 1,
            "huge": 3.5
        },
        "ac": 20,
        "hp": {
            "small": 20,
            "medium": 40,
            "large": 80,
            "huge": 120
        },
        "immunities": [
            "poison",
            "psychic"
        ],
        "vulnerabilities": [
            "fire"
        ],
        "description": "A solar sail is a magically enhanced sail that can provide the ship with sailing power when used in the sun. The more sails that are solar sails on the ship the more free Sail Crew Actions you get. Up to the maximum of your Sail based Sail Stations."
    },
    "Peddles System": {
        "name": "Peddles System",
        "price": {
            "small": 100,
            "medium": 250,
            "large": 600,
            "huge": 1500
        },
        "rarity": "Very Rare",
        "weight": {
            "small": 0.2,
            "medium": 2,
            "large": 15,
            "huge": 35
        },
        "description": "A Peddles System is a simple system that allows sailors to sit down on benches and paddle a big rotor on the back of the airship. Allowing for some constant Engine power without the cost of burning fuel. A really eco-friendly solution at the cost of your crew. A Peddling system can provide a part of the engine speed based upon the size of the ship. It can at most provide ⅔rd of the engine speed of a Small ship, ½ of a Medium, ⅓ of a Large and ¼ of a Huge ship (rounded up to nearest 5ft)."
    },
    "Whale Oil Engine": {
        "name": "Whale Oil Engine",
        "price": {
            "small": 300,
            "medium": 1500,
            "large": 4500,
            "huge": 18000
        },
        "rarity": "Common",
        "weight": {
            "small": 0.5,
            "medium": 4,
            "large": 20,
            "huge": 50
        },
        "description": "This engine, designed by the Royal Physician Anton Sokolov, is a wonder of the new world. Small version can provide power or even run motorcycles whereas large versions can run huge airships or even entire factories. They all use whale oil as fuel. Additional engines do not make an airship faster but can function as back up engines."
    },
    "Magic Core": {
        "name": "Magic Core",
        "price": {
            "small": 5000,
            "medium": 10000,
            "large": 25000,
            "huge": 100000
        },
        "rarity": "Very Rare",
        "weight": {
            "small": 0.1,
            "medium": 1,
            "large": 10,
            "huge": 50
        },
        "description": "This indestructible core can be made from any magical material that is suited for the job. There are however only few that have this ability. A true rarity this Core replaces the entire Whale Oil aspect of the Airship and replaces it with a specialized Magic Core engine."
    },
    "Teleportation Circle": {
        "name": "Teleportation Circle",
        "price": {
            "small": -1,
            "medium": -1,
            "large": 25000,
            "huge": 25000
        },
        "rarity": "Legendary",
        "weight": {
            "small": -1,
            "medium": -1,
            "large": 0,
            "huge": 0
        },
        "description": "Ships of Large size or larger can have a Teleportation circle bound on them for easy access. This does however cost a year of work by a pretty strong mage and therefore is rare."
    },
    "Automated Pilot": {
        "name": "Automated Pilot",
        "price": {
            "small": -1,
            "medium": 5000,
            "large": 10000,
            "huge": 25000
        },
        "rarity": "Uncommon",
        "weight": {
            "small": -1,
            "medium": 2,
            "large": 5,
            "huge": 20
        },
        "description": "This automated system can replace the helmsman on any Helmsman Required Airship for a simple journey when provided with a destination or route. It will keep the same height as started and will not avoid anything along the way but will give a loud warning when on a ramming course with something that might damage the ship."
    }
}