{
    "helmsman": {
        "name": "Helmsman Required",
        "description": "A ship with the “Helmsman Required” property usually have some sort of rudder or steering system on board that works independently of the ship’s main locomotion method. These ships can only move in a straight line, unless a crew member takes the Helm Crew Action that round. (for more information, see Chapter 2)."
    },
    "nohelmsman": {
        "name": "Automated Pilot",
        "description": "A ship with an Automated Pilot can follow a simple route, even without a helmsman. It can detect obstacles and sound an alarm when it is about to run into them, but cannot automatically avoid them."
    },
    "agile": {
        "name": "Agile",
        "description": "Agile ships are particularly manoeuvrable and easy to pilot. They are able to turn on the spot, instead of needing to move while turning as most other ships do. Turning does not take up any extra movement speed."
    },
    "mixedengine": {
        "name": "Mixed Propulsion (Whale Oil Engine)",
        "description": "A Mixed Propulsion ship is one that can use sails during windy conditions but has an alternate independent propulsion method (listed in brackets next to the property) in calmer weather. Mixed Propulsion ships act like Sail-Powered ships when their sails are unfurled. However, even when their sails are furled or they are in a Dead Wind, they still retain their normal speed unit."
    },
    "mixedenginepaddling": {
        "name": "Mixed Propulsion (Whale Oil Engine, Paddling System)",
        "description": "A Mixed Propulsion ship is one that can use sails during windy conditions but has an alternate independent propulsion method (listed in brackets next to the property) in calmer weather. Mixed Propulsion ships act like Sail-Powered ships when their sails are unfurled. However, even when their sails are furled or they are in a Dead Wind, they still retain their normal speed unit."
    },
    "mixedpaddling": {
        "name": "Mixed Propulsion (Paddling System)",
        "description": "A Mixed Propulsion ship is one that can use sails during windy conditions but has an alternate independent propulsion method (listed in brackets next to the property) in calmer weather. Mixed Propulsion ships act like Sail-Powered ships when their sails are unfurled. However, even when their sails are furled or they are in a Dead Wind, they still retain their normal speed unit."
    },
    "independent": {
        "name": "Independent Propulsion",
        "description": "A ship with Independent Propulsion has a propulsion method that requires nothing but someone at the helm to activate the controls. When on aship with this property, a character taking the Helm Crew Action automatically grants the ship a base movement speed shown in the parenthesis. Any Sail actions taken are added to this base movement speed."
    },
    "sail": {
        "name": "Sail Powered",
        "description": "A ship with the “Sail Powered” property uses the power of the wind to blow through their sails in order to move. Ships with this property have a speed unit of 0 in a Dead Wind. They also may suffer additional penalties and/or bonuses in other wind conditions (see chapter 3). On its turn, a Sail Powered Ship that has had at least half of its Sail Stations successfully used that round may furl its sails instead of using its movement speed. A ship that has furled its sails is not considered Sail-Powered and has a speed unit of 0 until the sails are unfurled again. In order to unfurl its sails, half of the ships Sail Stations must have been successfully used that round."
    },
    "cumbersome": {
        "name": "Cumbersome",
        "description": "Ships with the Cumbersome trait areparticularly difficult to sail. The base DC threshold to performa successful Sail Crew Action is raised by 5, and attempting to turn requires the ship move forward two Speed Units worth of distance instead of one."
    }
}